[Survived] StringLiteral
src/utils/roi.js:7:12
     dataKey: "spy",
     label: "100% SPY benchmark",
     description: "Opportunity cost if fully invested in SPY",
-    color: "#6366f1",
+    color: "",
   },
   {

[Survived] StringLiteral
src/utils/roi.js:10:9
     color: "#6366f1",
   },
   {
-    id: "blended",
+    id: "",
     dataKey: "blended",
     label: "Blended benchmark",

[Survived] StringLiteral
src/utils/roi.js:11:14
   },
   {
     id: "blended",
-    dataKey: "blended",
+    dataKey: "",
     label: "Blended benchmark",
     description: "Risk-matched mix using start-of-day cash weights",

[Survived] StringLiteral
src/utils/roi.js:12:12
   {
     id: "blended",
     dataKey: "blended",
-    label: "Blended benchmark",
+    label: "",
     description: "Risk-matched mix using start-of-day cash weights",
     color: "#f97316",

[Survived] StringLiteral
src/utils/roi.js:14:12
     dataKey: "blended",
     label: "Blended benchmark",
     description: "Risk-matched mix using start-of-day cash weights",
-    color: "#f97316",
+    color: "",
   },
   {

[Survived] StringLiteral
src/utils/roi.js:18:14
   },
   {
     id: "exCash",
-    dataKey: "exCash",
+    dataKey: "",
     label: "Risk sleeve (ex-cash)",
     description: "Portfolio performance excluding the cash sleeve",

[Survived] StringLiteral
src/utils/roi.js:19:12
   {
     id: "exCash",
     dataKey: "exCash",
-    label: "Risk sleeve (ex-cash)",
+    label: "",
     description: "Portfolio performance excluding the cash sleeve",
     color: "#ec4899",

[Survived] StringLiteral
src/utils/roi.js:25:14
   },
   {
     id: "cash",
-    dataKey: "cash",
+    dataKey: "",
     label: "Cash yield",
     description: "Isolated cash performance with accrued interest",

[Killed] ObjectLiteral
src/utils/roi.js:32:28
   },
 ];
 
-const SERIES_SOURCE_KEYS = {
-  portfolio: "r_port",
-  spy: "r_spy_100",
-  blended: "r_bench_blended",
-  exCash: "r_ex_cash",
-  cash: "r_cash",
-};
+const SERIES_SOURCE_KEYS = {};
 
 function toNumeric(value) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.6172

[Killed] StringLiteral
src/utils/roi.js:33:14
 ];
 
 const SERIES_SOURCE_KEYS = {
-  portfolio: "r_port",
+  portfolio: "",
   spy: "r_spy_100",
   blended: "r_bench_blended",
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.3294

[Killed] BlockStatement
src/utils/roi.js:40:27
   cash: "r_cash",
 };
 
-function toNumeric(value) {
-  const number = Number(value);
-  if (!Number.isFinite(number)) {
-    return 0;
-  }
-  return Math.round((number + Number.EPSILON) * 10_000) / 10_000;
-}
+function toNumeric(value) {}
 
 export function mergeReturnSeries(series = {}) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.3777

[Killed] ConditionalExpression
src/utils/roi.js:42:7
 
 function toNumeric(value) {
   const number = Number(value);
-  if (!Number.isFinite(number)) {
+  if (true) {
     return 0;
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.8436

[Killed] ConditionalExpression
src/utils/roi.js:42:7
 
 function toNumeric(value) {
   const number = Number(value);
-  if (!Number.isFinite(number)) {
+  if (false) {
     return 0;
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.6356

[Killed] ArithmeticOperator
src/utils/roi.js:45:10
   if (!Number.isFinite(number)) {
     return 0;
   }
-  return Math.round((number + Number.EPSILON) * 10_000) / 10_000;
+  return Math.round((number + Number.EPSILON) * 10_000) * 10_000;
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.3972

[Killed] ArithmeticOperator
src/utils/roi.js:45:21
   if (!Number.isFinite(number)) {
     return 0;
   }
-  return Math.round((number + Number.EPSILON) * 10_000) / 10_000;
+  return Math.round((number + Number.EPSILON) / 10_000) / 10_000;
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.1838

[Killed] BlockStatement
src/utils/roi.js:51:76
 export function mergeReturnSeries(series = {}) {
   const entriesByDate = new Map();
 
-  for (const [targetKey, sourceKey] of Object.entries(SERIES_SOURCE_KEYS)) {
-    const sourceSeries = Array.isArray(series?.[sourceKey])
-      ? series[sourceKey]
-      : [];
-    for (const point of sourceSeries) {
-      const date = point?.date;
-      if (!date) {
-        continue;
-      }
-      const normalized = entriesByDate.get(date) ?? { date };
-      normalized[targetKey] = toNumeric(point?.value);
-      entriesByDate.set(date, normalized);
-    }
-  }
+  for (const [targetKey, sourceKey] of Object.entries(SERIES_SOURCE_KEYS)) {}
 
   const sortedDates = Array.from(entriesByDate.keys()).sort((a, b) =>
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.4221

[Survived] OptionalChaining
src/utils/roi.js:52:40
   const entriesByDate = new Map();
 
   for (const [targetKey, sourceKey] of Object.entries(SERIES_SOURCE_KEYS)) {
-    const sourceSeries = Array.isArray(series?.[sourceKey])
+    const sourceSeries = Array.isArray(series[sourceKey])
       ? series[sourceKey]
       : [];

[Killed] BlockStatement
src/utils/roi.js:55:39
     const sourceSeries = Array.isArray(series?.[sourceKey])
       ? series[sourceKey]
       : [];
-    for (const point of sourceSeries) {
-      const date = point?.date;
-      if (!date) {
-        continue;
-      }
-      const normalized = entriesByDate.get(date) ?? { date };
-      normalized[targetKey] = toNumeric(point?.value);
-      entriesByDate.set(date, normalized);
-    }
+    for (const point of sourceSeries) {}
   }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 24.5253

[Survived] OptionalChaining
src/utils/roi.js:56:20
       ? series[sourceKey]
       : [];
     for (const point of sourceSeries) {
-      const date = point?.date;
+      const date = point.date;
       if (!date) {
         continue;

[Killed] BooleanLiteral
src/utils/roi.js:57:11
       : [];
     for (const point of sourceSeries) {
       const date = point?.date;
-      if (!date) {
+      if (date) {
         continue;
       }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.8122

[Killed] ConditionalExpression
src/utils/roi.js:57:11
       : [];
     for (const point of sourceSeries) {
       const date = point?.date;
-      if (!date) {
+      if (true) {
         continue;
       }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.693

[Killed] LogicalOperator
src/utils/roi.js:60:26
       if (!date) {
         continue;
       }
-      const normalized = entriesByDate.get(date) ?? { date };
+      const normalized = entriesByDate.get(date) && {
+  date
+};
       normalized[targetKey] = toNumeric(point?.value);
       entriesByDate.set(date, normalized);
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 25.194

[Survived] OptionalChaining
src/utils/roi.js:61:41
         continue;
       }
       const normalized = entriesByDate.get(date) ?? { date };
-      normalized[targetKey] = toNumeric(point?.value);
+      normalized[targetKey] = toNumeric(point.value);
       entriesByDate.set(date, normalized);
     }

[Survived] ArrowFunction
src/utils/roi.js:66:61
     }
   }
 
-  const sortedDates = Array.from(entriesByDate.keys()).sort((a, b) =>
-    String(a).localeCompare(String(b)),
+  const sortedDates = Array.from(entriesByDate.keys()).sort(() => undefined,
   );
 

[Survived] MethodExpression
src/utils/roi.js:66:23
     }
   }
 
-  const sortedDates = Array.from(entriesByDate.keys()).sort((a, b) =>
-    String(a).localeCompare(String(b)),
-  );
+  const sortedDates = Array.from(entriesByDate.keys());
 
   return sortedDates.map((date) => {

[Killed] BlockStatement
src/utils/roi.js:70:36
     String(a).localeCompare(String(b)),
   );
 
-  return sortedDates.map((date) => {
-    const entry = entriesByDate.get(date) ?? { date };
-    return {
-      date,
-      portfolio: toNumeric(entry.portfolio),
-      spy: toNumeric(entry.spy),
-      blended: toNumeric(entry.blended),
-      exCash: toNumeric(entry.exCash),
-      cash: toNumeric(entry.cash),
-    };
-  });
+  return sortedDates.map((date) => {});
 }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.4059

[Killed] LogicalOperator
src/utils/roi.js:71:19
   );
 
   return sortedDates.map((date) => {
-    const entry = entriesByDate.get(date) ?? { date };
+    const entry = entriesByDate.get(date) && {
+  date
+};
     return {
       date,
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.6265

[Killed] BlockStatement
src/utils/roi.js:83:47
   });
 }
 
-function findClosestPrice(series, targetDate) {
-  if (!Array.isArray(series) || series.length === 0) {
-    return 0;
-  }
-
-  let previous = series[0].close ?? 0;
-  for (const point of series) {
-    if (point.date === targetDate) {
-      return point.close ?? previous;
-    }
-
-    if (point.date > targetDate) {
-      return previous;
-    }
-
-    previous = point.close ?? previous;
-  }
-
-  return previous;
-}
+function findClosestPrice(series, targetDate) {}
 
 export async function buildRoiSeries(transactions, priceFetcher) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

not ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 9.078

[Killed] BooleanLiteral
src/utils/roi.js:84:7
 }
 
 function findClosestPrice(series, targetDate) {
-  if (!Array.isArray(series) || series.length === 0) {
+  if (Array.isArray(series) || series.length === 0) {
     return 0;
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 19.7475

[Killed] BlockStatement
src/utils/roi.js:84:54
 }
 
 function findClosestPrice(series, targetDate) {
-  if (!Array.isArray(series) || series.length === 0) {
-    return 0;
-  }
+  if (!Array.isArray(series) || series.length === 0) {}
 
   let previous = series[0].close ?? 0;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 26.4924

[Survived] LogicalOperator
src/utils/roi.js:88:18
     return 0;
   }
 
-  let previous = series[0].close ?? 0;
+  let previous = series[0].close && 0;
   for (const point of series) {
     if (point.date === targetDate) {

[Killed] BlockStatement
src/utils/roi.js:89:31
   }
 
   let previous = series[0].close ?? 0;
-  for (const point of series) {
-    if (point.date === targetDate) {
-      return point.close ?? previous;
-    }
-
-    if (point.date > targetDate) {
-      return previous;
-    }
-
-    previous = point.close ?? previous;
-  }
+  for (const point of series) {}
 
   return previous;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.0231

[Killed] ConditionalExpression
src/utils/roi.js:90:9
 
   let previous = series[0].close ?? 0;
   for (const point of series) {
-    if (point.date === targetDate) {
+    if (true) {
       return point.close ?? previous;
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 20.0978

[Killed] EqualityOperator
src/utils/roi.js:90:9
 
   let previous = series[0].close ?? 0;
   for (const point of series) {
-    if (point.date === targetDate) {
+    if (point.date !== targetDate) {
       return point.close ?? previous;
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.0594

[Killed] LogicalOperator
src/utils/roi.js:91:14
   let previous = series[0].close ?? 0;
   for (const point of series) {
     if (point.date === targetDate) {
-      return point.close ?? previous;
+      return point.close && previous;
     }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.3826

[Killed] EqualityOperator
src/utils/roi.js:94:9
       return point.close ?? previous;
     }
 
-    if (point.date > targetDate) {
+    if (point.date <= targetDate) {
       return previous;
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.1477

[Killed] ConditionalExpression
src/utils/roi.js:94:9
       return point.close ?? previous;
     }
 
-    if (point.date > targetDate) {
+    if (true) {
       return previous;
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes
ok 1 - ROI remains invariant when scaling position sizes
  ---
  duration_ms: 21.7691
  type: 'test'
  ...

[Survived] LogicalOperator
src/utils/roi.js:98:16
       return previous;
     }
 
-    previous = point.close ?? previous;
+    previous = point.close && previous;
   }
 

[Killed] BlockStatement
src/utils/roi.js:105:66
 }
 
 export async function buildRoiSeries(transactions, priceFetcher) {
-  if (!Array.isArray(transactions) || transactions.length === 0) {
-    return [];
-  }
+  if (!Array.isArray(transactions) || transactions.length === 0) {}
 
   const tickers = [
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.3548

[Killed] ConditionalExpression
src/utils/roi.js:105:39
 }
 
 export async function buildRoiSeries(transactions, priceFetcher) {
-  if (!Array.isArray(transactions) || transactions.length === 0) {
+  if (!Array.isArray(transactions) || false) {
     return [];
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.0994

[Killed] ArrayDeclaration
src/utils/roi.js:106:12
 
 export async function buildRoiSeries(transactions, priceFetcher) {
   if (!Array.isArray(transactions) || transactions.length === 0) {
-    return [];
+    return ["Stryker was here"];
   }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 24.8506

[Killed] MethodExpression
src/utils/roi.js:111:7
 
   const tickers = [
     ...new Set(
-      transactions
-        .map((tx) => (typeof tx?.ticker === "string" ? tx.ticker.trim() : ""))
-        .filter((ticker) => ticker.length > 0),
+      transactions.map(tx => typeof tx?.ticker === "string" ? tx.ticker.trim() : ""),
     ),
   ];
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 24.5318

[Killed] ConditionalExpression
src/utils/roi.js:112:23
   const tickers = [
     ...new Set(
       transactions
-        .map((tx) => (typeof tx?.ticker === "string" ? tx.ticker.trim() : ""))
+        .map((tx) => (true ? tx.ticker.trim() : ""))
         .filter((ticker) => ticker.length > 0),
     ),
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.5782

[Killed] ConditionalExpression
src/utils/roi.js:112:23
   const tickers = [
     ...new Set(
       transactions
-        .map((tx) => (typeof tx?.ticker === "string" ? tx.ticker.trim() : ""))
+        .map((tx) => (false ? tx.ticker.trim() : ""))
         .filter((ticker) => ticker.length > 0),
     ),
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 19.9573

[Killed] EqualityOperator
src/utils/roi.js:113:29
     ...new Set(
       transactions
         .map((tx) => (typeof tx?.ticker === "string" ? tx.ticker.trim() : ""))
-        .filter((ticker) => ticker.length > 0),
+        .filter((ticker) => ticker.length >= 0),
     ),
   ];
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 35.3393

[Killed] ConditionalExpression
src/utils/roi.js:113:29
     ...new Set(
       transactions
         .map((tx) => (typeof tx?.ticker === "string" ? tx.ticker.trim() : ""))
-        .filter((ticker) => ticker.length > 0),
+        .filter((ticker) => true),
     ),
   ];
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.4794

[Killed] BlockStatement
src/utils/roi.js:118:35
   ];
   const symbols = [...tickers, "spy"];
   const priceMapEntries = await Promise.all(
-    symbols.map(async (symbol) => {
-      const result = await priceFetcher(symbol);
-      if (Array.isArray(result)) {
-        return [symbol, result];
-      }
-      if (result && Array.isArray(result.data)) {
-        return [symbol, result.data];
-      }
-      return [symbol, []];
-    }),
+    symbols.map(async (symbol) => {}),
   );
   const priceMap = Object.fromEntries(priceMapEntries);
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

not ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 8.5082

[Killed] ConditionalExpression
src/utils/roi.js:120:11
   const priceMapEntries = await Promise.all(
     symbols.map(async (symbol) => {
       const result = await priceFetcher(symbol);
-      if (Array.isArray(result)) {
+      if (false) {
         return [symbol, result];
       }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 17.4973

[Killed] BlockStatement
src/utils/roi.js:120:34
   const priceMapEntries = await Promise.all(
     symbols.map(async (symbol) => {
       const result = await priceFetcher(symbol);
-      if (Array.isArray(result)) {
-        return [symbol, result];
-      }
+      if (Array.isArray(result)) {}
       if (result && Array.isArray(result.data)) {
         return [symbol, result.data];
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 17.1278

[Survived] ConditionalExpression
src/utils/roi.js:123:11
       if (Array.isArray(result)) {
         return [symbol, result];
       }
-      if (result && Array.isArray(result.data)) {
+      if (false) {
         return [symbol, result.data];
       }

[Survived] LogicalOperator
src/utils/roi.js:123:11
       if (Array.isArray(result)) {
         return [symbol, result];
       }
-      if (result && Array.isArray(result.data)) {
+      if (result || Array.isArray(result.data)) {
         return [symbol, result.data];
       }

[Killed] LogicalOperator
src/utils/roi.js:130:21
     }),
   );
   const priceMap = Object.fromEntries(priceMapEntries);
-  const spySeries = priceMap.spy ?? [];
+  const spySeries = priceMap.spy && [];
   if (spySeries.length === 0) {
     return [];
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 17.296

[Killed] ConditionalExpression
src/utils/roi.js:131:7
   );
   const priceMap = Object.fromEntries(priceMapEntries);
   const spySeries = priceMap.spy ?? [];
-  if (spySeries.length === 0) {
+  if (true) {
     return [];
   }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 17.9566

[Killed] BlockStatement
src/utils/roi.js:131:31
   );
   const priceMap = Object.fromEntries(priceMapEntries);
   const spySeries = priceMap.spy ?? [];
-  if (spySeries.length === 0) {
-    return [];
-  }
+  if (spySeries.length === 0) {}
 
   const cumulativeShares = Object.fromEntries(
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.7875

[Killed] ArrayDeclaration
src/utils/roi.js:132:12
   const priceMap = Object.fromEntries(priceMapEntries);
   const spySeries = priceMap.spy ?? [];
   if (spySeries.length === 0) {
-    return [];
+    return ["Stryker was here"];
   }
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.2689

[Killed] ArrowFunction
src/utils/roi.js:136:17
   }
 
   const cumulativeShares = Object.fromEntries(
-    tickers.map((ticker) => [ticker, 0]),
+    tickers.map(() => undefined),
   );
   let initialValue = null;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

not ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 8.6098

[Killed] LogicalOperator
src/utils/roi.js:139:27
     tickers.map((ticker) => [ticker, 0]),
   );
   let initialValue = null;
-  const initialSpyPrice = spySeries[0].close ?? 0;
+  const initialSpyPrice = spySeries[0].close && 0;
 
   return spySeries.map((point) => {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.1448

[Killed] MethodExpression
src/utils/roi.js:143:5
 
   return spySeries.map((point) => {
     const date = point.date;
-    transactions
-      .filter((tx) => tx.date === date)
+    transactions
       .forEach((tx) => {
         const ticker = typeof tx?.ticker === "string" ? tx.ticker.trim() : "";
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.7161

[Killed] ConditionalExpression
src/utils/roi.js:144:23
   return spySeries.map((point) => {
     const date = point.date;
     transactions
-      .filter((tx) => tx.date === date)
+      .filter((tx) => true)
       .forEach((tx) => {
         const ticker = typeof tx?.ticker === "string" ? tx.ticker.trim() : "";
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 24.5703

[Killed] EqualityOperator
src/utils/roi.js:144:23
   return spySeries.map((point) => {
     const date = point.date;
     transactions
-      .filter((tx) => tx.date === date)
+      .filter((tx) => tx.date !== date)
       .forEach((tx) => {
         const ticker = typeof tx?.ticker === "string" ? tx.ticker.trim() : "";
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.0043

[Killed] BlockStatement
src/utils/roi.js:145:24
     const date = point.date;
     transactions
       .filter((tx) => tx.date === date)
-      .forEach((tx) => {
-        const ticker = typeof tx?.ticker === "string" ? tx.ticker.trim() : "";
-        if (!ticker) {
-          return;
-        }
-
-        if (!(ticker in cumulativeShares)) {
-          cumulativeShares[ticker] = 0;
-        }
-
-        if (tx.type === "BUY") {
-          cumulativeShares[ticker] += tx.shares;
-        } else if (tx.type === "SELL") {
-          cumulativeShares[ticker] -= tx.shares;
-        }
-      });
+      .forEach((tx) => {});
 
     const portfolioValue = tickers.reduce((total, ticker) => {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 20.725

[Killed] EqualityOperator
src/utils/roi.js:146:24
     transactions
       .filter((tx) => tx.date === date)
       .forEach((tx) => {
-        const ticker = typeof tx?.ticker === "string" ? tx.ticker.trim() : "";
+        const ticker = typeof tx?.ticker !== "string" ? tx.ticker.trim() : "";
         if (!ticker) {
           return;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.1564

[Killed] ConditionalExpression
src/utils/roi.js:146:24
     transactions
       .filter((tx) => tx.date === date)
       .forEach((tx) => {
-        const ticker = typeof tx?.ticker === "string" ? tx.ticker.trim() : "";
+        const ticker = false ? tx.ticker.trim() : "";
         if (!ticker) {
           return;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 20.7305

[Killed] BooleanLiteral
src/utils/roi.js:147:13
       .filter((tx) => tx.date === date)
       .forEach((tx) => {
         const ticker = typeof tx?.ticker === "string" ? tx.ticker.trim() : "";
-        if (!ticker) {
+        if (ticker) {
           return;
         }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.081

[Killed] ConditionalExpression
src/utils/roi.js:147:13
       .filter((tx) => tx.date === date)
       .forEach((tx) => {
         const ticker = typeof tx?.ticker === "string" ? tx.ticker.trim() : "";
-        if (!ticker) {
+        if (true) {
           return;
         }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 20.7054

[Survived] BooleanLiteral
src/utils/roi.js:151:13
           return;
         }
 
-        if (!(ticker in cumulativeShares)) {
+        if (ticker in cumulativeShares) {
           cumulativeShares[ticker] = 0;
         }

[Survived] BlockStatement
src/utils/roi.js:151:44
           return;
         }
 
-        if (!(ticker in cumulativeShares)) {
-          cumulativeShares[ticker] = 0;
-        }
+        if (!(ticker in cumulativeShares)) {}
 
         if (tx.type === "BUY") {

[Killed] BlockStatement
src/utils/roi.js:155:32
           cumulativeShares[ticker] = 0;
         }
 
-        if (tx.type === "BUY") {
-          cumulativeShares[ticker] += tx.shares;
-        } else if (tx.type === "SELL") {
+        if (tx.type === "BUY") {} else if (tx.type === "SELL") {
           cumulativeShares[ticker] -= tx.shares;
         }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.5683
