[Killed] EqualityOperator
src/utils/roi.js:155:13
           cumulativeShares[ticker] = 0;
         }
 
-        if (tx.type === "BUY") {
+        if (tx.type !== "BUY") {
           cumulativeShares[ticker] += tx.shares;
         } else if (tx.type === "SELL") {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.0446

[Survived] AssignmentOperator
src/utils/roi.js:156:11
         }
 
         if (tx.type === "BUY") {
-          cumulativeShares[ticker] += tx.shares;
+          cumulativeShares[ticker] -= tx.shares;
         } else if (tx.type === "SELL") {
           cumulativeShares[ticker] -= tx.shares;

[Survived] EqualityOperator
src/utils/roi.js:157:20
 
         if (tx.type === "BUY") {
           cumulativeShares[ticker] += tx.shares;
-        } else if (tx.type === "SELL") {
+        } else if (tx.type !== "SELL") {
           cumulativeShares[ticker] -= tx.shares;
         }

[Survived] BlockStatement
src/utils/roi.js:157:40
 
         if (tx.type === "BUY") {
           cumulativeShares[ticker] += tx.shares;
-        } else if (tx.type === "SELL") {
-          cumulativeShares[ticker] -= tx.shares;
-        }
+        } else if (tx.type === "SELL") {}
       });
 

[Survived] AssignmentOperator
src/utils/roi.js:158:11
         if (tx.type === "BUY") {
           cumulativeShares[ticker] += tx.shares;
         } else if (tx.type === "SELL") {
-          cumulativeShares[ticker] -= tx.shares;
+          cumulativeShares[ticker] += tx.shares;
         }
       });

[Killed] BlockStatement
src/utils/roi.js:162:62
         }
       });
 
-    const portfolioValue = tickers.reduce((total, ticker) => {
-      const price = findClosestPrice(priceMap[ticker], date);
-      return total + cumulativeShares[ticker] * price;
-    }, 0);
+    const portfolioValue = tickers.reduce((total, ticker) => {}, 0);
 
     if (initialValue === null) {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

not ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 9.2786

[Killed] ArithmeticOperator
src/utils/roi.js:164:22
 
     const portfolioValue = tickers.reduce((total, ticker) => {
       const price = findClosestPrice(priceMap[ticker], date);
-      return total + cumulativeShares[ticker] * price;
+      return total + cumulativeShares[ticker] / price;
     }, 0);
 
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.4229

[Survived] ArithmeticOperator
src/utils/roi.js:164:14
 
     const portfolioValue = tickers.reduce((total, ticker) => {
       const price = findClosestPrice(priceMap[ticker], date);
-      return total + cumulativeShares[ticker] * price;
+      return total - cumulativeShares[ticker] * price;
     }, 0);
 

[Killed] ConditionalExpression
src/utils/roi.js:167:9
       return total + cumulativeShares[ticker] * price;
     }, 0);
 
-    if (initialValue === null) {
+    if (true) {
       initialValue = portfolioValue;
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 24.4528

[Killed] EqualityOperator
src/utils/roi.js:167:9
       return total + cumulativeShares[ticker] * price;
     }, 0);
 
-    if (initialValue === null) {
+    if (initialValue !== null) {
       initialValue = portfolioValue;
     }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

not ok 1 - ROI remains invariant when scaling position sizes
  ---
  duration_ms: 10.9338
  type: 'test'

[Killed] ConditionalExpression
src/utils/roi.js:172:7
     }
 
     const portfolioRoi =
-      initialValue === 0
+      true
         ? 0
         : ((portfolioValue - initialValue) / initialValue) * 100;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 20.9728

[Killed] EqualityOperator
src/utils/roi.js:172:7
     }
 
     const portfolioRoi =
-      initialValue === 0
+      initialValue !== 0
         ? 0
         : ((portfolioValue - initialValue) / initialValue) * 100;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 28.0536

[Killed] ArithmeticOperator
src/utils/roi.js:174:13
     const portfolioRoi =
       initialValue === 0
         ? 0
-        : ((portfolioValue - initialValue) / initialValue) * 100;
+        : ((portfolioValue + initialValue) / initialValue) * 100;
     const spyPrice = point.close ?? initialSpyPrice;
     const spyRoi =
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.8381

[Killed] ArithmeticOperator
src/utils/roi.js:174:12
     const portfolioRoi =
       initialValue === 0
         ? 0
-        : ((portfolioValue - initialValue) / initialValue) * 100;
+        : ((portfolioValue - initialValue) * initialValue) * 100;
     const spyPrice = point.close ?? initialSpyPrice;
     const spyRoi =
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

not ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 30.7771

[Killed] LogicalOperator
src/utils/roi.js:175:22
       initialValue === 0
         ? 0
         : ((portfolioValue - initialValue) / initialValue) * 100;
-    const spyPrice = point.close ?? initialSpyPrice;
+    const spyPrice = point.close && initialSpyPrice;
     const spyRoi =
       initialSpyPrice === 0
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.0518

[Killed] ConditionalExpression
src/utils/roi.js:177:7
         : ((portfolioValue - initialValue) / initialValue) * 100;
     const spyPrice = point.close ?? initialSpyPrice;
     const spyRoi =
-      initialSpyPrice === 0
+      true
         ? 0
         : ((spyPrice - initialSpyPrice) / initialSpyPrice) * 100;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 20.4692

[Killed] EqualityOperator
src/utils/roi.js:177:7
         : ((portfolioValue - initialValue) / initialValue) * 100;
     const spyPrice = point.close ?? initialSpyPrice;
     const spyRoi =
-      initialSpyPrice === 0
+      initialSpyPrice !== 0
         ? 0
         : ((spyPrice - initialSpyPrice) / initialSpyPrice) * 100;
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 20.7763

[Killed] ArithmeticOperator
src/utils/roi.js:179:12
     const spyRoi =
       initialSpyPrice === 0
         ? 0
-        : ((spyPrice - initialSpyPrice) / initialSpyPrice) * 100;
+        : ((spyPrice - initialSpyPrice) * initialSpyPrice) * 100;
 
     return {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 21.2993

[Killed] ArithmeticOperator
src/utils/roi.js:179:11
     const spyRoi =
       initialSpyPrice === 0
         ? 0
-        : ((spyPrice - initialSpyPrice) / initialSpyPrice) * 100;
+        : (spyPrice - initialSpyPrice) / initialSpyPrice / 100;
 
     return {
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 22.7289

[Killed] ObjectLiteral
src/utils/roi.js:181:12
         ? 0
         : ((spyPrice - initialSpyPrice) / initialSpyPrice) * 100;
 
-    return {
-      date,
-      portfolio: Number(portfolioRoi.toFixed(3)),
-      spy: Number(spyRoi.toFixed(3)),
-      blended: 0,
-      exCash: 0,
-      cash: 0,
-    };
+    return {};
   });
 }
killedBy: All tests
statusReason: TAP version 13

# Subtest: ROI remains invariant when scaling position sizes

not ok 1 - ROI remains invariant when scaling position sizes

  ---
  duration_ms: 9.9036
